package day1;
/**
 * 2021/04/06 처음으로 깃헙에 가입하여 글을 올려봅니다.
 * 지난 한달간 학습하며 느꼈던 Terminology의 중요성을 다시금 느껴보며 용어들을 정리해보려 합니다.
 * 앞으로 꾸준히 학습한 내용들을 업로드 해보겠습니다.
 */
public class JavaTerminology {
	//객체 : 객체 지향 프로그램의 대상
	//클래스 : 객체를 프로그래밍 하기 위해 코드로 정의해놓은 상태
	//인스턴스 : new 키워드를 사용하여 클래스를 메모리에 생성한 상태
	//멤버변수 : 클래스의 속성, 특성
	//메서드 : 멤버변수를 이용하여 클래스의 기능을 구현한 함수
	//참조변수 : 메모리에 생성된 인스턴스를 가리키는 변수
	//참조값 : 생성된 인스턴스의 메모리 주소 값
	//매개변수(파라미터) : 메서드 수행에 필요한 입력값을 저장하는 변수
	
	//예문
	JavaTerminology JT = new JavaTerminology();
	// 위 예문에서 
	//JavaTerminology : JavaTerminology 클래스 자료형
	//JT : 참조변수 (인스턴스를 가리킴)
	//파라미터는 ()안에 쓰인다.
}
